Catalogs/КлючНастроек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Catalog>
		<Properties>
			<Name>КлючНастроек</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КлючОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/КлючНастроек/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	Если Основная и не Ссылка.Основная Тогда  
		запрос = новый запрос("ВЫБРАТЬ
		|	КлючНастроек.Ссылка
		|ИЗ
		|	Справочник.КлючНастроек КАК КлючНастроек
		|ГДЕ
		|	КлючНастроек.Основная
		|	И КлючНастроек.КлючОбъекта = &КлючОбъекта");
		запрос.УстановитьПараметр("КлючОбъекта", КлючОбъекта); 
		
		рез = запрос.Выполнить().Выбрать();
		
		Если рез.Следующий() Тогда 
			об = рез.ссылка.получитьОбъект();
			об.основная = ложь;
			об.записать();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
